app/controllers/students_controller.rb

  def edit
    @student = Student.find_by(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @student = Student.find_by(id: params[:id])
    @student.update(params.require(:student))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-09-05 19:59:18.130864"], ["id", 1]]